; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v5)
             (pred_5 ?v1 ?v10)
             (pred_11 ?v2 ?v10)
             (pred_9 ?v8 ?v2 )
	     (pred_12 ?v2)
             (pred_1 ?v12)
             (pred_2 ?v1)
             (pred_6 ?v10)
             (pred_10 ?v2)
             (pred_7 ?v1)
             (pred_8 ?v2)
             (pred_3 ))



(:action op_4
:parameters (?v9 ?v6 ?v13 ?v7)
:precondition (and (pred_1 ?v9) (pred_1 ?v6) (pred_2 ?v13) (pred_6 ?v7)
          (pred_4 ?v9 ?v6) (pred_5 ?v13 ?v7)
                   (pred_11 ?v6 ?v7) (pred_12 ?v9) 
                   (pred_10 ?v6) (pred_7 ?v13))
:effect (and  (pred_8 ?v6) (not (pred_10 ?v6))))


(:action op_3
:parameters (?v9 ?v11)
:precondition (and (pred_1 ?v9) (pred_1 ?v11)
               (pred_12 ?v9) (pred_4 ?v9 ?v11) (pred_8 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v9))))

(:action op_1
:parameters (?v9 ?v13)
:precondition (and (pred_1 ?v9) (pred_2 ?v13) 
                  (pred_12 ?v9) (pred_9 ?v13 ?v9) (pred_3 ))
:effect (and (pred_7 ?v13)
   (not (pred_9 ?v13 ?v9)) (not (pred_3 ))))


(:action op_5
:parameters (?v9 ?v4 ?v3)
:precondition (and (pred_1 ?v9) (pred_2 ?v4) (pred_2 ?v3)
                  (pred_12 ?v9) (pred_7 ?v3) (pred_9 ?v4 ?v9))
:effect (and (pred_7 ?v4) (pred_9 ?v3 ?v9)
        (not (pred_7 ?v3)) (not (pred_9 ?v4 ?v9))))

(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_1 ?v9) (pred_2 ?v13) 
                  (pred_12 ?v9) (pred_7 ?v13))
:effect (and (pred_3 ) (pred_9 ?v13 ?v9) (not (pred_7 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_20 obj_19 obj_02 obj_16 obj_11 obj_08 obj_25 obj_27 obj_06 obj_01 obj_28 obj_05 obj_03 obj_18 obj_13 obj_24 obj_09 obj_32 obj_10 obj_22 obj_12 obj_21 obj_23 obj_14
    obj_17 obj_31 obj_07
    obj_29 obj_04 obj_15 obj_30
    )

    (:init
       (pred_3)

       (pred_1 obj_26)
       (pred_1 obj_20)
       (pred_1 obj_19)
       (pred_1 obj_02)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_08)
       (pred_1 obj_25)
       (pred_1 obj_27)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_28)
       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_24)
       (pred_1 obj_09)
       (pred_1 obj_32)
       (pred_1 obj_10)
       (pred_1 obj_22)
       (pred_1 obj_12)
       (pred_1 obj_21)
       (pred_1 obj_23)
       (pred_1 obj_14)
       (pred_6 obj_17)
       (pred_6 obj_31)
       (pred_6 obj_07)
       (pred_2 obj_29)
       (pred_2 obj_04)
       (pred_2 obj_15)
       (pred_2 obj_30)

       (pred_4 obj_26 obj_11)
       (pred_4 obj_26 obj_20)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_19)
       (pred_4 obj_20 obj_26)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_19 obj_02)
       (pred_4 obj_19 obj_20)
       (pred_4 obj_02 obj_27)
       (pred_4 obj_02 obj_16)
       (pred_4 obj_02 obj_19)
       (pred_4 obj_16 obj_06)
       (pred_4 obj_16 obj_02)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_08)
       (pred_4 obj_11 obj_26)
       (pred_4 obj_08 obj_28)
       (pred_4 obj_08 obj_25)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_11)
       (pred_4 obj_25 obj_05)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_25 obj_08)
       (pred_4 obj_27 obj_03)
       (pred_4 obj_27 obj_06)
       (pred_4 obj_27 obj_02)
       (pred_4 obj_27 obj_25)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_06 obj_27)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_28)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_28 obj_24)
       (pred_4 obj_28 obj_05)
       (pred_4 obj_28 obj_08)
       (pred_4 obj_28 obj_01)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_25)
       (pred_4 obj_05 obj_28)
       (pred_4 obj_03 obj_32)
       (pred_4 obj_03 obj_18)
       (pred_4 obj_03 obj_27)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_18 obj_03)
       (pred_4 obj_13 obj_22)
       (pred_4 obj_13 obj_24)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_24 obj_12)
       (pred_4 obj_24 obj_09)
       (pred_4 obj_24 obj_28)
       (pred_4 obj_24 obj_13)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_09 obj_32)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_24)
       (pred_4 obj_32 obj_23)
       (pred_4 obj_32 obj_10)
       (pred_4 obj_32 obj_03)
       (pred_4 obj_32 obj_09)
       (pred_4 obj_10 obj_14)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_10 obj_32)
       (pred_4 obj_22 obj_12)
       (pred_4 obj_22 obj_13)
       (pred_4 obj_12 obj_21)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_12 obj_22)
       (pred_4 obj_21 obj_23)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_12)
       (pred_4 obj_23 obj_14)
       (pred_4 obj_23 obj_32)
       (pred_4 obj_23 obj_21)
       (pred_4 obj_14 obj_10)
       (pred_4 obj_14 obj_23)
       (pred_10 obj_27)
       (pred_10 obj_28)
       (pred_10 obj_21)
       (pred_10 obj_19)
       (pred_11  obj_27 obj_17)
       (pred_11  obj_28 obj_31)
       (pred_11  obj_21 obj_07)
       (pred_11  obj_19 obj_17)
       (pred_8 obj_26)
       (pred_8 obj_20)
       (pred_8 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_25)
       (pred_8 obj_06)
       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_8 obj_24)
       (pred_8 obj_09)
       (pred_8 obj_32)
       (pred_8 obj_10)
       (pred_8 obj_22)
       (pred_8 obj_12)
       (pred_8 obj_23)
       (pred_8 obj_14)

       (pred_5  obj_29 obj_17)
       (pred_5  obj_04 obj_31)
       (pred_5  obj_15 obj_07)
       (pred_5  obj_30 obj_07)
       (pred_9 obj_29 obj_24)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_30 obj_26)
       (pred_12 obj_09)
    )

    (:goal (and
       (pred_9 obj_04 obj_23)
       (pred_9 obj_30 obj_13)
    ))
(:constraints
  (always (not (pred_12 obj_01)))
)
)

; plan
1. (op_3 obj_09 obj_24)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_24)
   goals met: 0 of 2
2. (op_1 obj_24 obj_29)
   deleted: (pred_9 obj_29 obj_24) (pred_3)
   added: (pred_7 obj_29)
   goals met: 0 of 2
3. (op_3 obj_24 obj_13)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_13)
   goals met: 0 of 2
4. (op_2 obj_13 obj_29)
   deleted: (pred_7 obj_29)
   added: (pred_3) (pred_9 obj_29 obj_13)
   goals met: 0 of 2
5. (op_3 obj_13 obj_24)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_24)
   goals met: 0 of 2
6. (op_3 obj_24 obj_09)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_09)
   goals met: 0 of 2
7. (op_3 obj_09 obj_05)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_05)
   goals met: 0 of 2
8. (op_3 obj_05 obj_25)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_25)
   goals met: 0 of 2
9. (op_3 obj_25 obj_08)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_08)
   goals met: 0 of 2
10. (op_3 obj_08 obj_11)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_11)
   goals met: 0 of 2
11. (op_3 obj_11 obj_26)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_26)
   goals met: 0 of 2
12. (op_1 obj_26 obj_30)
   deleted: (pred_9 obj_30 obj_26) (pred_3)
   added: (pred_7 obj_30)
   goals met: 0 of 2
13. (op_3 obj_26 obj_11)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_11)
   goals met: 0 of 2
14. (op_3 obj_11 obj_08)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_08)
   goals met: 0 of 2
15. (op_3 obj_08 obj_25)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_25)
   goals met: 0 of 2
16. (op_3 obj_25 obj_05)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_05)
   goals met: 0 of 2
17. (op_3 obj_05 obj_09)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_09)
   goals met: 0 of 2
18. (op_3 obj_09 obj_24)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_24)
   goals met: 0 of 2
19. (op_3 obj_24 obj_13)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_13)
   goals met: 0 of 2
20. (op_2 obj_13 obj_30)
   deleted: (pred_7 obj_30)
   added: (pred_3) (pred_9 obj_30 obj_13)
   goals met: 1 of 2
21. (op_3 obj_13 obj_24)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_24)
   goals met: 1 of 2
22. (op_3 obj_24 obj_09)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_09)
   goals met: 1 of 2
23. (op_3 obj_09 obj_05)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_05)
   goals met: 1 of 2
24. (op_3 obj_05 obj_25)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_25)
   goals met: 1 of 2
25. (op_3 obj_25 obj_08)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_08)
   goals met: 1 of 2
26. (op_3 obj_08 obj_11)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_11)
   goals met: 1 of 2
27. (op_1 obj_11 obj_04)
   deleted: (pred_9 obj_04 obj_11) (pred_3)
   added: (pred_7 obj_04)
   goals met: 1 of 2
28. (op_3 obj_11 obj_08)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_08)
   goals met: 1 of 2
29. (op_3 obj_08 obj_25)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_25)
   goals met: 1 of 2
30. (op_3 obj_25 obj_05)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_05)
   goals met: 1 of 2
31. (op_3 obj_05 obj_03)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_03)
   goals met: 1 of 2
32. (op_3 obj_03 obj_32)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_32)
   goals met: 1 of 2
33. (op_3 obj_32 obj_23)
   deleted: (pred_12 obj_32)
   added: (pred_12 obj_23)
   goals met: 1 of 2
34. (op_2 obj_23 obj_04)
   deleted: (pred_7 obj_04)
   added: (pred_3) (pred_9 obj_04 obj_23)
   goals met: 2 of 2
